; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 684448 2 1 4 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	spectrograph2 - mode
	thermograph3 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite1 Phenomenon5)
	(have_image Planet4 spectrograph2)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon6 image1)
	(have_image Planet7 image1)
	(have_image Planet8 image1)
	(have_image Phenomenon9 thermograph3)
))

)

; plan
1. (turn_to satellite1 phenomenon5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
3. (turn_to satellite0 groundstation2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 8
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 8
5. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
6. (turn_to satellite1 planet4 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet4)
   goals met: 0 of 8
7. (turn_to satellite0 planet8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet8)
   goals met: 0 of 8
8. (turn_to satellite1 groundstation3 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 8
9. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 1 of 8
10. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 8
11. (turn_to satellite0 phenomenon6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 8
12. (turn_to satellite1 planet4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet4)
   goals met: 1 of 8
13. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 2 of 8
14. (take_image satellite1 planet4 instrument1 spectrograph2)
   added: (have_image planet4 spectrograph2)
   goals met: 3 of 8
15. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 8
16. (turn_to satellite1 phenomenon5 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 phenomenon5)
   goals met: 5 of 8
17. (take_image satellite0 phenomenon5 instrument0 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 6 of 8
18. (turn_to satellite1 phenomenon9 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 8
19. (turn_to satellite0 planet7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet7)
   goals met: 4 of 8
20. (take_image satellite1 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 5 of 8
21. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 6 of 8
22. (turn_to satellite1 phenomenon5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon5)
   goals met: 7 of 8
23. (turn_to satellite0 phenomenon5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon5)
   goals met: 8 of 8
